docs: final updates to README.md
